# RebarShapeSegment Properties

---
The RebarShapeSegment type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace